Revit 2024 API
RoutingPreferenceManager.OwnerId Property
 The Id of the MEPCurveType that owns the RoutingPreferenceManager
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public ElementId OwnerId { get; }
Visual Basic
Public ReadOnly Property OwnerId As ElementId
	Get
Visual C++
public:
property ElementId^ OwnerId {
	ElementId^ get ();
}
See Also
RoutingPreferenceManager Class
Autodesk.Revit.DB Namespace